(*
    Напишіть функцію get_nth, яка приймає список рядків і int n 
    та повертає n-й елемент списку, де голова списку є першим значенням. 
    Не турбуйтеся якщо в списку занадто мало елементів: 
    у цьому випадку ваша функція може навіть застосувати 
    hd або tl до порожнього списку, і це нормально.
*)

fun get_nth(pos: int, lst: string list) =
    if pos = 1
        then hd lst
        else get_nth(pos - 1, tl lst);
        
get_nth(2, ["000", "111", "222", "333", "444"]);

(*
    val it = "111" : string
*)